; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; USE CASE - 3 - Projection Aware Human-in-the-Loop Plan Execution
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain PAPE-hilp)

(:requirements :strips :typing)

(:types
block
human robot - agent
)

(:predicates
(on ?a - agent ?x ?y - block)
(ontable ?x - block)
(clear ?x - block)
(holding ?a - agent ?x - block)
(handempty ?a - agent)
(isword ?b1 ?b2 ?b3 - block)
(word-formed ?a - agent)
(which-word ?a - agent ?b1 ?b2 ?b3 - block)
)

(:action makeword
:parameters (?a - agent ?b1 ?b2 ?b3 - block)
:precondition
(and
(on ?a ?b1 ?b2)
(on ?a ?b2 ?b3)
(clear ?b1)
(isword ?b1 ?b2 ?b3)
)
:effect
(and
(word-formed ?a)
(which-word ?a ?b1 ?b2 ?b3)
)
)

(:action pick-up
:parameters (?a - agent ?x - block)
:precondition
(and
(clear ?x)
(ontable ?x)
(handempty ?a)
)
:effect
(and
(not (ontable ?x))
(not (clear ?x))
(not (handempty ?a))
(holding ?a ?x)
)
)

(:action put-down
:parameters (?a - agent ?x - block)
:precondition
(and
(holding ?a ?x)
)
:effect
(and
(not (holding ?a ?x))
(clear ?x)
(handempty ?a)
(ontable ?x)
)
)

(:action stack
:parameters (?a - agent ?x ?y - block)
:precondition
(and
(holding ?a ?x)
(clear ?y)
)
:effect
(and
(not (holding ?a ?x))
(not (clear ?y))
(clear ?x)
(handempty ?a)
(on ?a ?x ?y)
)
)

(:action unstack
:parameters (?a - agent ?x ?y - block)
:precondition
(and
(on ?a ?x ?y)
(clear ?x)
(handempty ?a)
)
:effect
(and
(holding ?a ?x)
(clear ?y)
(not (clear ?x))
(not (handempty ?a))
(not (on ?a ?x ?y))
)
)

)

; problem
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; USE CASE - 3 - Projection Aware Human-in-the-Loop Plan Execution
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (problem BRAT-hilp)

(:domain PAPE-hilp)

(:objects
A B C O R T  - block
Fetch - robot
Me - human
)

(:init
;; hand is empty
(handempty Fetch)
(handempty Me)
;; all blocks are clear
(clear A)
(clear B)
(clear C)
(clear O)
(clear R)
(clear T)
;; all blocks on the table
(ontable A)
(ontable B)
(ontable C)
(ontable O)
(ontable R)
(ontable T)
;; available words
(isword A R T)
(isword R A T)
(isword C O B)
)

(:goal
(and
(word-formed Fetch)
(word-formed Me)
)
)

)

; plan
1. (pick-up fetch a)
   deleted: (ontable a) (clear a) (handempty fetch)
   added: (holding fetch a)
   goals met: 0 of 2
2. (pick-up me o)
   deleted: (ontable o) (clear o) (handempty me)
   added: (holding me o)
   goals met: 0 of 2
3. (stack me o b)
   deleted: (holding me o) (clear b)
   added: (clear o) (handempty me) (on me o b)
   goals met: 0 of 2
4. (pick-up me c)
   deleted: (ontable c) (clear c) (handempty me)
   added: (holding me c)
   goals met: 0 of 2
5. (stack fetch a t)
   deleted: (holding fetch a) (clear t)
   added: (clear a) (handempty fetch) (on fetch a t)
   goals met: 0 of 2
6. (pick-up fetch r)
   deleted: (ontable r) (clear r) (handempty fetch)
   added: (holding fetch r)
   goals met: 0 of 2
7. (stack fetch r a)
   deleted: (holding fetch r) (clear a)
   added: (clear r) (handempty fetch) (on fetch r a)
   goals met: 0 of 2
8. (makeword fetch r a t)
   added: (word-formed fetch) (which-word fetch r a t)
   goals met: 1 of 2
9. (stack me c o)
   deleted: (holding me c) (clear o)
   added: (clear c) (handempty me) (on me c o)
   goals met: 1 of 2
10. (makeword me c o b)
   added: (word-formed me) (which-word me c o b)
   goals met: 2 of 2
